Repository: LuizFonseca06/smart-rest-client
Catalog: docs_src/source/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: Smart API Client is an Wrapper to perform requests to Rest APIs using objects to request endpoints and their methods
pt_br: Smart API Client é um Wrapper para realizar solicitações para Rest APIs usandoobjetos para solicitar endpoints e seus métodos

source: User Guide
pt_br: Guia do Usuário

source: Base Settings
pt_br: Configurações Basicas

source: Create a clients.py file in the core folder of your project, if you haven't, created it within your project folder to be simple to be imported from anywhere in the project with the following content:
pt_br: Crie um arquivo clients.py em alguma pasta nucleo do seu projeto, caso não tenha, crie dentro da sua pasta do projeto para ficar mais simples de ser importado de qualquer lugar do projeto com o seguinte conteúdo:

source: The name of this variable will be the name of the client that you can use throughout your project
pt_br: O nome dessa variável será o nome do cliente que será importado para cada projeto

source: It is recommended that the production use a set of configurations without configurations.py to change the simple way or the name of the API without the need to create several.
pt_br: É recomendável que o nome venha de uma constante no arquivo settings.py, e se possível ser até uma variável de ambiente

source: In our case, we have the option of "production" and "localhost", the factory generates the customer according to the name used and the parameters identified in it
pt_br: No nosso caso, temos a opção de "produção"e "localhost", oa fábrica gera o cliente de acordo com o nome utilizado e oparâmetros identificados nele

source: Let's imagine which client is located in a folder called clients on project folder (folder containing the settings.py file)
pt_br: Vamos imaginar que o cliente esta em uma pasta dentro da pasta do projeto (pasta que contém o arquivo settings.py)

source: Example
pt_br: Exemplo

source: Import the api_client from your client.py file
pt_br: Importe o api_client do seu arquivo client.py

source: Development
pt_br: Desenvolvimento
